-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: localhost    Database: librarydb
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `author` varchar(255) NOT NULL,
  `publisher` varchar(255) DEFAULT NULL,
  `year` int DEFAULT NULL,
  `location` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (1,'Доріан Грей','Оскар Уайльд','Видавництво Сонце',1920,'Стелаж 3'),(4,'Книга чудес 12','Клоун','Сонце круг',2025,'Стелаж 30'),(5,'Казки Світу','Андерсен','Круг',2020,'Стелаж 4'),(6,'Струмок намір кидати мимо','Тимофій Стець','Даньків-Гайдамака',1998,'Зал 3, Полиця K6'),(7,'Услати в\'язниця легко пастух повністю','Миколай Євдокименко','Охріменко Inc',2011,'Зал 2, Полиця D9'),(8,'Коробка покидати','Устим Аверченко','Заєць-Їжакевич',1980,'Зал 3, Полиця 19'),(9,'Уточнити мигнути актриса вскакивать','Христина Єременко','Джус Inc',2016,'Зал 2, Полиця N2'),(10,'Ягода отже наштовхнутися мимо','Амалія Нестеренко','Андрусенко, Нестеренко and Шиян',1975,'Зал 2, Полиця U7'),(11,'Жити досліджено функція прохід подробиця','Алевтин Верховинець','Твердохліб PLC',1994,'Зал 2, Полиця K10'),(12,'Правління хід натиснути','Пармен Стець','Свириденко Group',1974,'Зал 1, Полиця R3'),(13,'Труп кидати кордон співати шкарпетка','Борислав Оніщук','Павличенко, Дашкевич and Оробець',1994,'Зал 2, Полиця D1'),(14,'Взагалі художній','Ярослава Чередник','Пелех Group',2004,'Зал 1, Полиця I7'),(15,'Відповісти байдужий колишній','Наталія Давимука','Зінчук-Демʼяненко',2011,'Зал 2, Полиця V8'),(16,'Спорт триста шкільний закласти','Опанас Скиба','Байдак, Рубан and Забашта',1979,'Зал 2, Полиця R1'),(17,'Перебивати призначити грати','Валерій Симоненко','Якимчук Group',2009,'Зал 3, Полиця B3'),(18,'Поставити що багряний забирати','Віолетта Дахно','Дзиндра, Сомко and Деряжна',2009,'Зал 2, Полиця A1'),(19,'Ліловий кора лівий','Хмара Лукʼян Демидович','Щорс-Доценко',1980,'Зал 3, Полиця A5'),(20,'Степ заклад','Тереза Шеремета','Терещук-Дейсун',1994,'Зал 1, Полиця U4'),(21,'Упустити легко','Зиновій Христенко','Сацюк, Артимишина and Шеремета',2015,'Зал 3, Полиця H7'),(22,'Район дихання вказаний несподіваний','Орхип Стець','Юхименко PLC',2016,'Зал 3, Полиця H10'),(23,'Сміття радити пісенька','Лілія Авраменко','Дейнека Group',1982,'Зал 2, Полиця I6'),(24,'Радити процес знімати художній','Борис Голобородько','Левченко, Дзиндра and Оберемко',1994,'Зал 1, Полиця D6'),(25,'Навіщо виражений від\'їзд знімати підкинути','Тетяна Іваненко','Андрощук LLC',1992,'Зал 1, Полиця H8'),(26,'Встати фахівець','Антон Сацюк','Кабалюк PLC',2009,'Зал 3, Полиця D10'),(27,'Отже тьмяний секунда загроза','Зорян Девдюк','Масляк, Запорожець and Вишняк',1995,'Зал 1, Полиця B10'),(28,'Заклик вибирати деякий','пан Лукʼян Бабариченко','Андрієвич-Гайдабура',1998,'Зал 2, Полиця K5'),(29,'Нестерпний редактор польовий','Едуард Вертипорох','Шеремета Ltd',2012,'Зал 1, Полиця A6'),(30,'Аж співати зміна домогтися','Арсен Чаленко','Іваненко, Романчук and Жарко',2009,'Зал 2, Полиця I5'),(31,'Прірва самостійно','Лукʼян Девдюк','Артимишина, Запорожець and Макаренко',2024,'Зал 3, Полиця S6'),(32,'Палиця метелик командир приятель','Хома Алексюк','Гайденко and Sons',2000,'Зал 2, Полиця X7'),(33,'Вітрина командування колишній хлопець','Масоха Соломія Пантелеймонівна','Яценюк-Вакуленко',2003,'Зал 3, Полиця Z8'),(34,'Валюта бок','Ребрик Ольга Венедиктівна','Яценюк, Лисенко and Гунько',2007,'Зал 1, Полиця Y3'),(35,'Військовий мотоцикл блискучий нога','пані Світлана Корж','Верес Inc',1997,'Зал 1, Полиця A7'),(36,'Залучати присісти валюта незручно','пані Оксана Цимбал','Авдєєнко Group',1989,'Зал 1, Полиця D6'),(37,'Спорт наполегливо підземний який','Павло Щербань','Бабко PLC',2018,'Зал 3, Полиця Y3'),(38,'Незвичний супроводжуватися встати багаття','Ярина Єрьоменко','Власенко, Іваничук and Свириденко',1997,'Зал 2, Полиця H10'),(39,'Адже другий','Марʼяна Сірко','Скоробогатько, Іваненко and Христенко',1984,'Зал 2, Полиця E3'),(40,'Спорт космос падаль подвірʼя','Давимука Амалія Тарасівна','Лагода PLC',2019,'Зал 2, Полиця O3'),(41,'Страта витягувати господь','Бабич Богданна Леонідівна','Тиха, Абрамчук and Вітрук',1996,'Зал 1, Полиця Y10'),(42,'Адже роса обуритися червень','Гаєвська Анжела Стефанівна','Дейсун, Гречко and Калениченко',1982,'Зал 3, Полиця I5'),(43,'Палата квапливий пісенька забирати чоловічок','Аврелій Тарасенко','Годунок, Терещенко and Павленко',1991,'Зал 2, Полиця D7'),(44,'Простір мотоцикл','Адам Ващенко-Захарченко','Рубець, Чередник and Корсун',2006,'Зал 3, Полиця O7'),(45,'Розуміти що-небудь вітати правління висіти','Скирда Роксолана Костянтинівна','Непорожній-Гриценко',2000,'Зал 3, Полиця I8'),(47,'книга 1','автор','видавець',1919,'Полиця 1'),(49,'Якась назва','хтось','сонце',2012,'Зал 1 полиця 20'),(50,'Книга','автор','сонце',2024,'схід');
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `borrowings`
--

DROP TABLE IF EXISTS `borrowings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `borrowings` (
  `id` int NOT NULL AUTO_INCREMENT,
  `book_id` int NOT NULL,
  `reader_id` int NOT NULL,
  `borrow_date` datetime NOT NULL,
  `return_date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `book_id` (`book_id`),
  KEY `reader_id` (`reader_id`),
  CONSTRAINT `borrowings_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`),
  CONSTRAINT `borrowings_ibfk_2` FOREIGN KEY (`reader_id`) REFERENCES `readers` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `borrowings`
--

LOCK TABLES `borrowings` WRITE;
/*!40000 ALTER TABLE `borrowings` DISABLE KEYS */;
INSERT INTO `borrowings` VALUES (2,4,3,'2025-06-09 17:17:14','2025-06-09 17:23:01'),(3,4,3,'2025-06-09 17:34:22','2025-06-10 13:56:48'),(4,15,15,'2025-06-04 17:39:07',NULL),(5,10,18,'2025-05-13 03:02:59','2025-05-26 03:02:59'),(6,19,24,'2025-06-04 14:09:39',NULL),(7,18,16,'2025-05-20 00:50:58','2025-06-09 00:50:58'),(8,20,13,'2025-05-22 04:34:26','2025-05-24 04:34:26'),(9,17,22,'2025-05-21 09:09:46','2025-05-24 09:09:46'),(10,4,13,'2025-05-31 10:08:37','2025-06-01 10:08:37'),(11,5,20,'2025-06-05 19:33:30','2025-06-21 19:33:30'),(12,7,19,'2025-06-01 16:32:50',NULL),(13,1,3,'2025-06-05 04:13:26','2025-06-19 04:13:26'),(14,25,4,'2025-05-14 12:30:29','2025-05-22 12:30:29'),(15,25,18,'2025-05-27 09:38:05','2025-06-10 09:38:05'),(16,21,11,'2025-06-03 21:22:56','2025-06-13 21:22:56'),(17,16,9,'2025-05-26 11:34:57','2025-06-15 11:34:57'),(18,6,21,'2025-05-20 15:04:04','2025-05-30 15:04:04'),(19,1,14,'2025-05-23 07:45:19','2025-06-06 07:45:19'),(20,22,19,'2025-06-03 12:26:44','2025-06-18 12:26:44'),(21,15,1,'2025-05-20 23:33:42','2025-05-26 23:33:42'),(22,19,9,'2025-05-25 04:10:12','2025-06-05 04:10:12'),(23,15,11,'2025-05-16 06:50:26','2025-05-28 06:50:26'),(24,7,19,'2025-06-01 20:14:34','2025-06-15 20:14:34'),(25,21,19,'2025-06-03 02:31:22','2025-06-20 02:31:22'),(26,17,10,'2025-05-21 15:28:32',NULL),(27,9,15,'2025-06-07 21:43:48','2025-06-27 21:43:48'),(28,18,8,'2025-06-05 00:33:52','2025-06-23 00:33:52'),(29,15,8,'2025-06-10 12:29:49','2025-06-17 12:29:49'),(30,21,1,'2025-06-09 10:21:27','2025-06-26 10:21:27'),(31,6,5,'2025-06-08 11:55:04','2025-06-13 11:55:04'),(32,10,21,'2025-06-05 20:04:27',NULL),(33,11,9,'2025-06-01 05:32:05','2025-06-09 05:32:05'),(34,24,7,'2025-05-23 13:37:22',NULL),(35,16,13,'2025-06-08 22:46:57','2025-06-12 22:46:57'),(36,5,18,'2025-05-29 20:21:28',NULL),(37,5,24,'2025-05-22 07:18:58',NULL),(38,18,11,'2025-06-05 18:30:54','2025-06-08 18:30:54'),(39,15,11,'2025-05-14 22:16:31',NULL),(40,12,19,'2025-05-13 11:06:02','2025-05-22 11:06:02'),(41,21,10,'2025-05-21 20:46:13','2025-06-01 20:46:13'),(42,4,5,'2025-06-06 04:58:52','2025-06-15 04:58:52'),(43,6,15,'2025-05-16 23:12:19','2025-06-05 23:12:19'),(44,21,9,'2025-06-09 23:21:52','2025-06-14 23:21:52'),(45,23,3,'2025-05-20 08:02:56','2025-05-25 08:02:56'),(46,7,15,'2025-05-27 21:33:23',NULL),(47,12,22,'2025-05-21 12:34:43',NULL),(48,24,21,'2025-05-20 21:24:55','2025-06-09 21:24:55'),(49,5,23,'2025-06-01 09:10:33','2025-06-20 09:10:33'),(50,23,8,'2025-05-18 19:20:36','2025-06-05 19:20:36'),(51,24,1,'2025-05-24 19:18:36','2025-05-27 19:18:36'),(52,22,7,'2025-05-14 13:02:07',NULL),(53,10,9,'2025-06-04 07:27:37',NULL),(54,8,8,'2025-06-16 14:31:23','2025-06-16 14:32:12'),(55,11,15,'2025-06-16 14:54:14',NULL),(56,1,15,'2025-06-16 14:54:38',NULL),(57,9,15,'2025-06-16 14:55:04',NULL),(58,34,24,'2025-06-08 22:43:51','2025-06-26 22:43:51'),(59,7,20,'2025-06-03 12:31:41','2025-06-20 12:31:41'),(61,25,40,'2025-06-16 19:51:01',NULL),(62,19,26,'2025-06-21 12:44:01','2025-07-07 12:44:01'),(63,5,31,'2025-06-21 16:47:24','2025-06-24 16:47:24'),(64,14,39,'2025-05-30 16:50:53','2025-06-03 16:50:53'),(65,39,29,'2025-06-09 15:26:20','2025-06-18 15:26:20'),(66,17,14,'2025-05-31 14:20:32',NULL),(67,9,8,'2025-06-10 08:51:20','2025-06-25 08:51:20'),(68,34,20,'2025-06-09 16:31:47','2025-06-18 16:31:47'),(69,35,9,'2025-05-31 06:47:17','2025-06-01 06:47:17'),(70,40,23,'2025-06-09 04:17:58','2025-06-20 04:17:58'),(71,16,43,'2025-06-04 00:48:41','2025-06-23 00:48:41'),(72,21,25,'2025-06-13 11:09:07','2025-07-03 11:09:07'),(73,36,25,'2025-06-06 19:07:05','2025-06-25 19:07:05'),(74,41,18,'2025-06-12 10:37:33','2025-06-16 10:37:33'),(75,19,1,'2025-06-17 22:40:29','2025-06-18 22:40:29'),(76,37,1,'2025-06-08 17:12:04',NULL),(77,35,36,'2025-06-15 02:46:43',NULL),(78,40,27,'2025-06-08 09:38:22','2025-06-16 09:38:22'),(79,6,7,'2025-05-31 14:59:05','2025-06-18 14:59:05'),(80,27,28,'2025-06-07 21:48:00','2025-06-20 21:48:00'),(81,19,38,'2025-06-04 11:18:37',NULL),(82,7,26,'2025-06-19 10:20:18',NULL),(83,27,38,'2025-05-31 23:21:06','2025-06-07 23:21:06'),(84,23,34,'2025-06-08 13:01:21',NULL),(85,29,18,'2025-05-28 10:05:18',NULL),(86,36,14,'2025-06-20 14:51:38','2025-06-29 14:51:38'),(87,40,36,'2025-06-24 21:49:35','2025-07-06 21:49:35'),(88,38,39,'2025-06-24 21:32:12','2025-07-12 21:32:12'),(89,20,21,'2025-05-29 12:15:55','2025-06-04 12:15:55'),(90,39,5,'2025-06-25 06:54:45','2025-07-05 06:54:45'),(91,16,20,'2025-06-11 06:35:12','2025-06-24 06:35:12'),(92,7,4,'2025-06-09 05:07:32',NULL),(93,30,44,'2025-06-16 22:36:44','2025-07-05 22:36:44'),(94,37,8,'2025-05-29 23:05:05',NULL),(95,10,3,'2025-06-02 19:45:16','2025-06-06 19:45:16'),(96,45,1,'2025-05-31 14:22:59','2025-06-06 14:22:59'),(97,5,4,'2025-06-09 07:41:30',NULL),(98,35,16,'2025-05-31 04:15:36','2025-06-16 04:15:36'),(99,11,23,'2025-06-21 05:30:28',NULL),(100,34,8,'2025-06-19 18:36:40',NULL),(101,15,31,'2025-06-22 22:46:26','2026-09-03 12:34:46'),(102,24,24,'2025-06-18 12:43:19','2025-06-24 12:43:19'),(103,44,9,'2025-06-15 23:12:45','2025-06-28 23:12:45'),(104,30,42,'2025-06-04 07:23:05','2025-06-10 07:23:05'),(105,25,19,'2025-06-03 21:30:40','2025-06-11 21:30:40'),(106,6,32,'2025-05-31 12:47:17',NULL),(107,20,26,'2025-05-29 20:53:13','2025-06-09 20:53:13'),(108,35,22,'2025-06-17 05:04:07',NULL),(109,35,33,'2025-06-14 23:46:05','2025-06-30 23:46:05'),(110,6,10,'2025-06-21 21:40:03','2026-09-03 13:48:56'),(111,6,3,'2025-06-03 09:40:27','2025-06-08 09:40:27'),(112,45,33,'2025-05-28 01:44:47',NULL),(113,12,36,'2025-06-09 20:11:00',NULL),(114,27,38,'2025-06-08 12:37:12','2025-06-11 12:37:12'),(115,12,4,'2025-06-11 09:38:04','2025-06-27 09:38:04'),(116,33,33,'2025-06-20 23:42:56','2025-06-25 23:42:56'),(118,29,11,'2025-06-13 10:46:56','2025-06-16 10:46:56'),(119,19,11,'2025-06-21 03:05:59','2025-06-25 03:05:59'),(120,31,44,'2025-06-24 21:44:12','2025-07-08 21:44:12'),(121,34,26,'2025-06-10 12:51:23','2025-06-23 12:51:23'),(123,21,6,'2025-05-30 01:13:50','2025-06-19 01:13:50'),(124,5,18,'2025-06-02 11:49:11','2025-06-21 11:49:11'),(125,37,30,'2025-06-20 03:42:19','2025-07-02 03:42:19'),(126,40,3,'2025-05-28 19:10:36','2025-06-01 19:10:36'),(127,27,18,'2025-05-28 17:24:30',NULL),(128,31,8,'2025-05-31 15:30:39','2025-06-13 15:30:39'),(129,5,8,'2025-06-08 12:23:34','2025-06-12 12:23:34'),(130,40,23,'2025-05-28 06:07:52','2025-06-04 06:07:52'),(131,21,10,'2025-06-24 17:49:06','2025-06-26 17:49:06'),(132,14,38,'2025-06-12 17:58:18','2025-06-14 17:58:18'),(133,30,15,'2025-06-14 21:13:06','2025-06-28 21:13:06'),(134,19,1,'2025-06-11 04:00:23','2025-06-20 04:00:23'),(135,29,21,'2025-06-12 02:59:35',NULL),(136,39,28,'2025-06-02 22:02:27',NULL),(137,21,24,'2025-05-27 22:01:39','2025-06-08 22:01:39'),(138,7,20,'2025-06-11 16:57:50',NULL),(139,44,6,'2025-06-20 07:52:36','2025-06-29 07:52:36'),(140,5,27,'2025-06-12 06:33:51','2025-06-13 06:33:51'),(141,13,23,'2025-06-23 04:28:59','2025-07-01 04:28:59'),(142,8,27,'2025-06-05 16:13:33','2025-06-20 16:13:33'),(143,7,29,'2025-06-22 16:19:12','2025-07-03 16:19:12'),(144,26,11,'2025-06-21 13:48:47','2025-07-09 13:48:47'),(145,18,20,'2025-05-29 13:43:01',NULL),(146,1,34,'2025-06-13 20:10:05','2025-06-28 20:10:05'),(147,34,22,'2025-06-22 19:30:45','2026-09-03 12:34:56'),(148,37,33,'2025-06-22 17:54:44','2025-07-09 17:54:44'),(149,1,22,'2025-06-20 16:36:12','2025-07-01 16:36:12'),(150,34,7,'2025-06-25 04:23:39','2025-07-11 04:23:39'),(151,26,17,'2025-06-20 12:00:11','2026-09-03 13:55:22'),(152,17,22,'2025-06-19 00:03:26','2025-07-04 00:03:26'),(153,6,24,'2025-06-07 04:07:12','2025-06-21 04:07:12'),(154,6,42,'2025-06-09 23:40:23',NULL),(155,45,12,'2025-06-12 21:29:37','2025-06-14 21:29:37'),(156,32,14,'2025-05-27 10:29:26','2025-06-01 10:29:26'),(157,29,42,'2025-06-18 15:05:44','2025-06-30 15:05:44'),(158,14,6,'2025-06-25 16:43:20','2025-06-25 16:43:35'),(160,20,9,'2026-09-03 12:52:31','2026-09-03 13:48:48');
/*!40000 ALTER TABLE `borrowings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `readers`
--

DROP TABLE IF EXISTS `readers`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `readers` (
  `id` int NOT NULL AUTO_INCREMENT,
  `first_name` varchar(100) NOT NULL,
  `last_name` varchar(100) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `readers`
--

LOCK TABLES `readers` WRITE;
/*!40000 ALTER TABLE `readers` DISABLE KEYS */;
INSERT INTO `readers` VALUES (1,'Христофор','Колумб','chacha25@gmail.com','+380938857383','м.Львів, вул. Карпинця І, буд. 27, кв. 313'),(3,'Анна','Величко','123456werty@q.com','+380559590505','м.Львів, вул.Коновальця, буд. 115'),(4,'Василина','Коваль','vas.kov@a.com','+380969599494','Львів'),(5,'Ярема','Оліфіренко','valentynkovalenko@example.net','+380954488947','шосе Чернігівський, буд. 4 кв. 8, Костянтинівка, 12417'),(6,'Соломон','Шило','epavlyk@example.org','+380671723168','проспект Проектований 4-й, буд. 0, Бурштин, 07013'),(7,'Устим','Доценко','cshovkoplias@example.com','+380977157759','шосе Андросовський, буд. 9 кв. 2, Тараща, 09383'),(8,'Борислав','Чумак','eshyian@example.com','+380974647208','парк Сергія Ядова, буд. 287, Вишневе, 17801'),(9,'Ліза','Парасюк','romanetsiryna@example.org','+380999155968','набережна Миколи Костомарова, буд. 700 кв. 235, Таврійськ, 61406'),(10,'Богуслава','Коваль','oryna79@example.org','+380979383573','вулиця Балківська, буд. 257 кв. 7, Рудки, 35449'),(11,'Марта','Дзиндра','iaryna85@example.net','+380689769634','шосе Текстильників, буд. 81 кв. 2, Надвірна, 18294'),(12,'Анастасія','Бебешко','adaiemelianenko@example.net','+380683981242','парк Миколи Боровського, буд. 608, Броди, 44440'),(13,'Августина','Андрієвич','erubets@example.org','+380923803436','провулок Мелодійний, буд. 05 кв. 8, Старобільськ, 58819'),(14,'Ірина','Затовканюк','havriushenkobohuslav@example.com','+380735638468','узвіз Отонівський, буд. 992 кв. 83, Березань, 05715'),(15,'Андрій','Міщенко','ielysaveta14@example.org','+380991232698','площа Садова 3-тя, буд. 3, Зугрес, 98501'),(16,'Пилип','Вернигора','myron11@example.com','+380948131097','набережна Студентський 4-й, буд. 69, Зеленодольськ, 60312'),(17,'Людмила','Євтушенко','spas31@example.net','+380934768849','шосе Нерубайська, буд. 293 кв. 7, Бобринець, 46340'),(18,'Вʼячеслав','Охримович','frankopriska@example.com','+380945616341','проспект Петра Лещенка, буд. 68, Новодністровськ, 01922'),(19,'Трохим','Бездітко','baidakyrylo@example.net','+380734493602','сквер Нафтовиків 1-й, буд. 008, Козятин, 99729'),(20,'Мирон','Чекалюк','zorian13@example.org','+380667675095','сквер Східчастий 3-й, буд. 6, Гірник, 44558'),(21,'Орхип','Малик','masokhaokhrim@example.net','+380931967056','набережна Дмитра Годзенка, буд. 2, Каховка, 17897'),(22,'Тарас','Артимович','oksanaatamanchuk@example.org','+380396216275','набережна Суднобудівний, буд. 75, Іршава, 91809'),(23,'Геннадій','Дурдинець','iurchyshynspas@example.org','+380967175934','узвіз Пісочний, буд. 36 кв. 659, Броди, 49718'),(24,'Пармен','Симоненко','sbaida@example.org','+380732422416','набережна Творча, буд. 0 кв. 21, Старокостянтинів, 79429'),(25,'Клавдія','Лубенець','maksymazhazha@example.org','+380975808031','сквер Костанді 2-й, буд. 3 кв. 7, Старокостянтинів, 30419'),(26,'Вікторія','Ґереґа','oleksazaiets@example.com','+380924298386','провулок Бєлякова, буд. 1, Токмак, 49938'),(27,'Дарина','Штепа','hchornovil@example.org','+380926466559','узвіз Лінія 36-та, буд. 31, Сокологірськ, 30387'),(28,'Омелян','Черненко','bohodarmishchenko@example.org','+380637004582','узвіз Морський 2-й, буд. 42 кв. 75, Іловайськ, 26467'),(29,'Орися','Бебешко','averchenkovladyslav@example.com','+380666361475','сквер Поштова, буд. 395, Кам\'янське, 53729'),(30,'Данна','Верхола','ivaniarema@example.net','+380638618566','сквер Розумовський 2-й, буд. 8, Помічна, 37042'),(31,'Данна','Яценко','iaryna67@example.com','+380917805849','шосе Лінія 25-та, буд. 5 кв. 99, Тростянець, 89077'),(32,'Лукʼян','Баранник','edavydenko@example.com','+380925729128','площа Лінія 42-га, буд. 17 кв. 6, Кролевець, 52016'),(33,'Віталій','Артюх','iustyna31@example.com','+380918109884','парк Мирна, буд. 9, Єнакієве, 62990'),(34,'Святослава','Зінкевич','horlyk@example.net','+380938622429','площа Вільгельма Габсбурга, буд. 55 кв. 838, Канів, 65108'),(35,'Ігор','Забара','smykorkhyp@example.com','+380926051500','парк Зої Бутенко, буд. 7 кв. 7, Сіверськ, 15513'),(36,'Омелян','Шаблій','leopold46@example.net','+380399953663','площа Івасюка Володимира, буд. 0, Саки, 33314'),(37,'Василь','Шведченко','bartemenko@example.net','+380965873659','парк Озерна, буд. 258 кв. 2, Кипуче, 09935'),(38,'Людмила','Алексеєнко','lparasiuk@example.com','+380995837540','набережна Проїзний 3-й, буд. 30, Берислав, 59808'),(39,'Пармен','Штепа','solomiiatkach@example.org','+380922834188','парк Амундсена, 3-й, буд. 76, Нововолинськ, 48380'),(40,'Максим','Ґерус','frantsbakumenko@example.net','+380951161338','площа Іванова Ігоря, буд. 9 кв. 863, Татарбунари, 37919'),(41,'Алла','Дзюба','fedir51@example.com','+380948628434','шосе Астрономічна, буд. 54, Моспине, 17869'),(42,'Едита','Деряжний','ivanprytula@example.com','+380943940182','набережна Дніпровська, буд. 04 кв. 56, Батурин, 16339'),(43,'Соломон','Свистун','olesdarahan@example.com','+380508902403','площа Маячний, буд. 2, Канів, 43833'),(44,'Варфоломій','Дахно','prokhir17@example.com','+380915955538','шосе Романтичний, буд. 15 кв. 271, Таврійськ, 35500');
/*!40000 ALTER TABLE `readers` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `full_name` varchar(100) DEFAULT NULL,
  `role` enum('guest','librarian') NOT NULL DEFAULT 'guest',
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'librarian','$argon2id$v=19$m=65536,t=3,p=4$+FNN0GBP2UtjxW5JpGaRTg$c7byGDSeg7xy6GqBP+/rU4U82aFP9F6J6oKHEzvIJl8','Головний Бібліотекар','librarian',1,'2026-09-03 05:24:58'),(2,'guest','$argon2id$v=19$m=65536,t=3,p=4$dufAt6V4Ch1+fRoN8YDODg$3FHfWcJAhXSUFQAbMmt1zg9bGrqjY6rzQzNe524tSPQ','Гість Читач','guest',1,'2026-09-03 05:24:58');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-13 14:33:15
